# StairsSupporttypeSectionProfile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupporttypeSectionProfile Property
ParameterTypeId Class See Also
---
"Section Profile": Section Profile
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupporttypeSectionProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupporttypeSectionProfile As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupporttypeSectionProfile {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace